cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'

brew 'git'
brew 'ag'
brew 'libyaml'
brew 'gmp'
brew 'ruby-install'
brew 'chruby'
brew 'yarn'
brew 'nvm'

brew 'python'

brew 'graphviz'

brew 'libgit2'

# Java
cask 'java'

# OS X Preview plugins
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

# VM management
cask 'docker'
cask 'virtualbox'

# Code
cask 'sublime-text'
cask 'visual-studio-code'

# Database
cask 'postgres'
cask 'pgadmin4'

# GUI
cask 'alfred'
cask 'shiftit'
cask 'gitup'
cask 'sourcetree'
cask 'cyberduck'

# Communication
cask 'screenhero'
cask 'slack'
cask 'skype'
