cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'

brew 'ag'
brew 'ruby-install'
brew 'chruby'
brew 'nvm'

brew 'python'

brew 'graphviz'

brew 'heroku-toolbelt'

# Java
cask 'java'

# OS X Preview plugins
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

# VM management
cask 'virtualbox'
cask 'otto'

# Database
cask 'postgres'
cask 'pgadmin3'

# GUI
cask 'shiftit'
cask 'gitup'
cask 'sourcetree'
cask 'textmate'
cask 'sublime-text3'

# Communication
cask 'screenhero'
cask 'slack'